Repository: starcat-app/Starcat
Catalog: Starcat/Resources/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, id, it, ja, ko, nl, pl, pt_br, ru, tr, uk, vi, zh_hans, zh_hant

# codeFlow.overview.prepare.detail
source: Injects source and writes HTML and metadata
ar: حقن المصدر وكتابة HTML والبيانات الوصفية
de: Injiziert Quellcode und schreibt HTML und Metadaten
es: Inyecta el código fuente y escribe HTML y metadatos
fr: Injecte la source et écrit le HTML et les métadonnées
id: Menyuntikkan sumber dan menulis HTML serta metadata
it: Inietta il sorgente e scrive HTML e metadati
ja: ソースを注入し、HTMLとメタデータを書き込みます
ko: 소스 삽입 및 HTML과 메타데이터 작성
nl: Injecteert broncode en schrijft HTML en metadata
pl: Wstrzykuje kod źródłowy i zapisuje HTML oraz metadane
pt_br: Injeta o código-fonte e grava HTML e metadados
ru: Внедряет исходный код и записывает HTML и метаданные
tr: Kaynağı enjekte eder ve HTML ile meta verileri yazar
uk: Вставляє вихідний код і записує HTML та метадані
vi: Chèn mã nguồn và ghi HTML cùng siêu dữ liệu
zh_hans: 注入源码并写入 HTML 与 metadata
zh_hant: 注入原始碼並寫入 HTML 與 metadata

# codeFlow.overview.prepare.title
source: Prepare CodeFlow page
ar: تحضير صفحة CodeFlow
de: CodeFlow-Seite vorbereiten
es: Preparar página de CodeFlow
fr: Préparer la page CodeFlow
id: Siapkan halaman CodeFlow
it: Prepara pagina CodeFlow
ja: CodeFlowページを準備
ko: CodeFlow 페이지 준비
nl: CodeFlow-pagina voorbereiden
pl: Przygotuj stronę CodeFlow
pt_br: Preparar página do CodeFlow
ru: Подготовить страницу CodeFlow
tr: CodeFlow sayfasını hazırla
uk: Підготувати сторінку CodeFlow
vi: Chuẩn bị trang CodeFlow
zh_hans: 准备 CodeFlow 页面
zh_hant: 準備 CodeFlow 頁面

# codeFlow.panel.branch.subtitle
source: Downloads the latest commit snapshot of the selected branch.
ar: تنزيل أحدث لقطة للفرع المحدد.
de: Lädt den neuesten Commit-Snapshot des ausgewählten Branches herunter.
es: Descarga la instantánea del último commit de la rama seleccionada.
fr: Télécharge l'instantané du dernier commit de la branche sélectionnée.
id: Mengunduh snapshot commit terbaru dari cabang yang dipilih.
it: Scarica l'ultimo snapshot del commit del ramo selezionato.
ja: 選択したブランチの最新コミットスナップショットをダウンロードします。
ko: 선택한 브랜치의 최신 커밋 스냅샷을 다운로드합니다.
nl: Downloadt de laatste commit-momentopname van de geselecteerde branch.
pl: Pobiera migawkę najnowszego zatwierdzenia wybranej gałęzi.
pt_br: Baixa o snapshot do commit mais recente do branch selecionado.
ru: Загружает снимок последнего коммита выбранной ветки.
tr: Seçilen dalın en son işlem anlık görüntüsünü indirir.
uk: Завантажує знімок останнього коміту вибраної гілки.
vi: Tải xuống ảnh chụp nhanh commit mới nhất của nhánh đã chọn.
zh_hans: 下载所选分支最新 commit 的源码快照
zh_hant: 下載所選分支最新 commit 的原始碼快照

# codeFlow.panel.branch.title
source: Source branch
ar: فرع المصدر
de: Quellbranch
es: Rama de origen
fr: Branche source
id: Cabang sumber
it: Ramo sorgente
ja: ソースブランチ
ko: 소스 브랜치
nl: Bronbranch
pl: Gałąź źródłowa
pt_br: Branch de origem
ru: Исходная ветка
tr: Kaynak dal
uk: Вихідна гілка
vi: Nhánh nguồn
zh_hans: 生成分支
zh_hant: 產生分支

# codeFlow.panel.executionDetails
source: Execution details
ar: تفاصيل التنفيذ
de: Ausführungsdetails
es: Detalles de ejecución
fr: Détails d'exécution
id: Detail eksekusi
it: Dettagli esecuzione
ja: 実行の詳細
ko: 실행 세부사항
nl: Uitvoeringsdetails
pl: Szczegóły wykonania
pt_br: Detalhes da execução
ru: Детали выполнения
tr: Yürütme ayrıntıları
uk: Деталі виконання
vi: Chi tiết thực thi
zh_hans: 执行详情
zh_hant: 執行詳細資訊

# codeFlow.panel.title
source: CodeFlow code graph
ar: الرسم البياني للكود CodeFlow
es: Grafo de código CodeFlow
fr: Graphe de code CodeFlow
id: Grafik kode CodeFlow
it: Grafo del codice CodeFlow
ja: CodeFlowコードグラフ
ko: CodeFlow 코드 그래프
nl: CodeFlow-codegrafiek
pl: Graf kodu CodeFlow
pt_br: Grafo de código CodeFlow
ru: Граф кода CodeFlow
tr: CodeFlow kod grafiği
uk: Граф коду CodeFlow
vi: Đồ thị mã CodeFlow
zh_hans: CodeFlow 代码图谱
zh_hant: CodeFlow 程式碼圖譜

# codeFlow.runtime.branchLoadFailedFormat
source: Failed to load branch list: %@
ar: فشل تحميل قائمة الفروع: %@
de: Branch-Liste konnte nicht geladen werden: %@
es: Error al cargar la lista de ramas: %@
fr: Échec du chargement de la liste des branches : %@
id: Gagal memuat daftar cabang: %@
it: Caricamento elenco rami fallito: %@
ja: ブランチリストの読み込みに失敗しました: %@
ko: 브랜치 목록 로드 실패: %@
nl: Kan branchlijst niet laden: %@
pl: Nie udało się załadować listy gałęzi: %@
pt_br: Falha ao carregar lista de branches: %@
ru: Не удалось загрузить список веток: %@
tr: Dal listesi yüklenemedi: %@
uk: Не вдалося завантажити список гілок: %@
vi: Không tải được danh sách nhánh: %@
zh_hans: 分支列表加载失败：%@
zh_hant: 分支列表加载失败：%@

# codeFlow.runtime.cachedZipFormat
source: Hit shared source snapshot · %@
ar: تم العثور على لقطة مصدر مشتركة · %@
de: Gemeinsam genutzter Quell-Snapshot gefunden · %@
es: Instantánea de origen compartida encontrada · %@
fr: Instantané source partagé utilisé · %@
id: Menggunakan snapshot sumber bersama · %@
it: Snapshot sorgente condiviso trovato · %@
ja: 共有ソーススナップショットをヒット · %@
ko: 공유 소스 스냅샷 사용 · %@
nl: Gedeelde bronmomentopname gevonden · %@
pl: Trafiono współdzieloną migawkę źródła · %@
pt_br: Snapshot de origem compartilhado encontrado · %@
ru: Использован общий снимок исходного кода · %@
tr: Paylaşılan kaynak anlık görüntüsü alındı · %@
uk: Знайдено спільний знімок вихідного коду · %@
vi: Đã truy cập ảnh chụp nguồn chung · %@
zh_hans: 命中共享源码快照 · %@
zh_hant: 命中共享源码快照 · %@

# codeFlow.runtime.downloadedZipFormat
source: GitHub ZIP downloaded · %@
ar: تم تنزيل GitHub ZIP · %@
de: GitHub-ZIP heruntergeladen · %@
es: ZIP de GitHub descargado · %@
fr: ZIP GitHub téléchargé · %@
id: ZIP GitHub diunduh · %@
it: ZIP da GitHub scaricato · %@
ja: GitHub ZIP をダウンロード · %@
ko: GitHub ZIP 다운로드됨 · %@
nl: GitHub-ZIP gedownload · %@
pl: Pobrano ZIP z GitHub · %@
pt_br: ZIP do GitHub baixado · %@
ru: ZIP с GitHub загружен · %@
tr: GitHub ZIP indirildi · %@
uk: ZIP завантажено з GitHub · %@
vi: Đã tải xuống ZIP GitHub · %@
zh_hans: GitHub ZIP 下载完成 · %@
zh_hant: GitHub ZIP 下载完成 · %@

# codeFlow.runtime.downloadingZip
source: Fetching pinned-commit ZIP
ar: جلب ZIP المثبت عند commit
de: Pinned-Commit-ZIP wird abgerufen
es: Obteniendo ZIP del commit fijo
fr: Récupération du ZIP du commit épinglé
id: Mengambil ZIP commit tetap
it: Recupero ZIP del commit fissato
ja: 固定コミットの ZIP を取得中
ko: 고정 커밋 ZIP 가져오는 중
nl: Vastgelegde commit-ZIP ophalen
pl: Pobieranie ZIP z przypiętym zatwierdzeniem
pt_br: Buscando ZIP do commit fixo
ru: Получение ZIP с фиксированным коммитом
tr: Sabitlenmiş işlem ZIP'i getiriliyor
uk: Отримання ZIP з фіксованим комітом
vi: Đang tải xuống ZIP commit đã ghim
zh_hans: 正在获取固定 commit ZIP
zh_hant: 正在获取固定 commit ZIP

# codeFlow.runtime.handedToBrowser
source: Handed off to JSZip for extraction, analysis and rendering
ar: تم التسليم إلى JSZip للاستخراج والتحليل والعرض
de: An JSZip zur Extraktion, Analyse und Darstellung übergeben
es: Entregado a JSZip para extracción, análisis y renderizado
fr: Transféré à JSZip pour extraction, analyse et rendu
id: Diserahkan ke JSZip untuk ekstraksi, analisis, dan rendering
it: Passato a JSZip per estrazione, analisi e rendering
ja: JSZip に引き渡し、抽出・分析・レンダリングを実行
ko: JSZip에 전달되어 추출, 분석 및 렌더링
nl: Overgedragen aan JSZip voor extractie, analyse en weergave
pl: Przekazano do JSZip w celu ekstrakcji, analizy i renderowania
pt_br: Entregue ao JSZip para extração, análise e renderização
ru: Передано JSZip для извлечения, анализа и рендеринга
tr: JSZip'e çıkarma, analiz ve işleme için teslim edildi
uk: Передано JSZip для вилучення, аналізу та рендерингу
vi: Đã chuyển cho JSZip để giải nén, phân tích và hiển thị
zh_hans: 已交给 JSZip 解压、分析和渲染
zh_hant: 已交给 JSZip 解压、分析和渲染

# codeFlow.runtime.handingToBrowser
source: Handing off to system default browser
ar: جاري التسليم إلى المتصفح الافتراضي للنظام
de: Übergabe an den Standardbrowser
es: Transfiriendo al navegador predeterminado del sistema
fr: Transfert vers le navigateur par défaut du système
id: Menyerahkan ke browser default sistem
it: Passaggio al browser predefinito di sistema
ja: システムのデフォルトブラウザに引き渡し中
ko: 시스템 기본 브라우저로 전달 중
nl: Overdragen aan systeemstandaardbrowser
pl: Przekazywanie do domyślnej przeglądarki systemowej
pt_br: Entregando ao navegador padrão do sistema
ru: Передача системному браузеру по умолчанию
tr: Sistem varsayılan tarayıcısına teslim ediliyor
uk: Передача до системного браузера за замовчуванням
vi: Đang chuyển cho trình duyệt mặc định của hệ thống
zh_hans: 正在交给系统默认浏览器
zh_hant: 正在交给系统默认浏览器

# codeFlow.runtime.injectingZip
source: Injecting ZIP and generating page
ar: حقن ZIP وإنشاء الصفحة
de: ZIP wird injiziert und Seite generiert
es: Inyectando ZIP y generando página
fr: Injection du ZIP et génération de la page
id: Menyuntikkan ZIP dan menghasilkan halaman
it: Iniezione ZIP e generazione pagina
ja: ZIP を注入しページを生成中
ko: ZIP 삽입 및 페이지 생성 중
nl: ZIP injecteren en pagina genereren
pl: Wstrzykiwanie ZIP i generowanie strony
pt_br: Injetando ZIP e gerando página
ru: Внедрение ZIP и генерация страницы
tr: ZIP enjekte ediliyor ve sayfa oluşturuluyor
uk: Вставка ZIP та генерація сторінки
vi: Đang chèn ZIP và tạo trang
zh_hans: 正在注入 ZIP 并生成页面
zh_hant: 正在注入 ZIP 并生成页面

# codeFlow.runtime.pageWritten
source: HTML and metadata.json written
ar: تمت كتابة HTML و metadata.json
de: HTML und metadata.json geschrieben
es: HTML y metadata.json escritos
fr: HTML et metadata.json écrits
id: HTML dan metadata.json ditulis
it: HTML e metadata.json scritti
ja: HTML と metadata.json を書き込みました
ko: HTML 및 metadata.json 작성됨
nl: HTML en metadata.json geschreven
pl: Zapisano HTML i metadata.json
pt_br: HTML e metadata.json gravados
ru: HTML и metadata.json записаны
tr: HTML ve metadata.json yazıldı
uk: HTML та metadata.json записано
vi: Đã ghi HTML và metadata.json
zh_hans: HTML 与 metadata.json 写入完成
zh_hant: HTML 与 metadata.json 写入完成

# codeFlow.runtime.resolveRevisionFormat
source: Resolving latest commit on %@
ar: تحديد أحدث commit على %@
de: Letzten Commit auf %@ auflösen
es: Resolviendo el último commit en %@
fr: Résolution du dernier commit sur %@
id: Menyelesaikan commit terbaru di %@
it: Risoluzione ultimo commit su %@
ja: %@ の最新コミットを解決中
ko: %@의 최신 커밋 확인 중
nl: Laatste commit op %@ bepalen
pl: Rozpoznawanie najnowszego zatwierdzenia na %@
pt_br: Resolvendo commit mais recente em %@
ru: Определение последнего коммита на %@
tr: %@ üzerindeki en son işlem çözümleniyor
uk: Визначення останнього коміту на %@
vi: Đang phân giải commit mới nhất trên %@
zh_hans: 正在解析 %@ 最新提交
zh_hant: 正在解析 %@ 最新提交

# codeFlow.state.downloading
source: Fetching source snapshot…
ar: جاري جلب لقطة المصدر…
de: Quell-Snapshot wird abgerufen…
es: Obteniendo instantánea de origen…
fr: Récupération de l'instantané source…
id: Mengambil snapshot sumber…
it: Recupero snapshot sorgente…
ja: ソーススナップショットを取得中…
ko: 소스 스냅샷 가져오는 중…
nl: Bronmomentopname ophalen…
pl: Pobieranie migawki źródła…
pt_br: Buscando snapshot do código-fonte…
ru: Загрузка снимка исходного кода…
tr: Kaynak anlık görüntüsü getiriliyor…
uk: Отримання знімка вихідного коду…
vi: Đang tải xuống ảnh chụp nguồn…
zh_hans: 正在获取源码快照…
zh_hant: 正在获取源码快照…

# codeFlow.state.failed
source: Execution failed. See details.
ar: فشل التنفيذ. انظر التفاصيل.
de: Ausführung fehlgeschlagen. Details ansehen.
es: Ejecución fallida. Consulta los detalles.
fr: Échec de l'exécution. Voir les détails.
id: Eksekusi gagal. Lihat detail.
it: Esecuzione fallita. Vedi dettagli.
ja: 実行に失敗しました。詳細を確認してください。
ko: 실행 실패. 세부사항을 확인하세요.
nl: Uitvoering mislukt. Zie details.
pl: Wykonanie nie powiodło się. Zobacz szczegóły.
pt_br: Falha na execução. Veja os detalhes.
ru: Выполнение не удалось. См. подробности.
tr: Yürütme başarısız oldu. Ayrıntılara bakın.
uk: Виконання не вдалося. Див. деталі.
vi: Thực thi thất bại. Xem chi tiết.
zh_hans: 执行失败，请查看详情
zh_hant: 执行失败，请查看详情

# codeFlow.state.idle
source: Ready
ar: جاهز
de: Bereit
es: Listo
fr: Prêt
id: Siap
it: Pronto
ja: 準備完了
ko: 준비
nl: Gereed
pl: Gotowy
pt_br: Pronto
ru: Готово
tr: Hazır
uk: Готово
vi: Sẵn sàng
zh_hans: 准备就绪
zh_hant: 准备就绪

# codeFlow.state.opening
source: Opening browser…
ar: جاري فتح المتصفح…
de: Browser wird geöffnet…
es: Abriendo navegador…
fr: Ouverture du navigateur…
id: Membuka browser…
it: Apertura browser…
ja: ブラウザを開いています…
ko: 브라우저 여는 중…
nl: Browser openen…
pl: Otwieranie przeglądarki…
pt_br: Abrindo navegador…
ru: Открытие браузера…
tr: Tarayıcı açılıyor…
uk: Відкриття браузера…
vi: Đang mở trình duyệt…
zh_hans: 正在打开浏览器…
zh_hant: 正在打开浏览器…

# codeFlow.state.preparing
source: Generating page…
ar: جاري إنشاء الصفحة…
de: Seite wird generiert…
es: Generando página…
fr: Génération de la page…
id: Menghasilkan halaman…
it: Generazione pagina…
ja: ページを生成中…
ko: 페이지 생성 중…
nl: Pagina genereren…
pl: Generowanie strony…
pt_br: Gerando página…
ru: Генерация страницы…
tr: Sayfa oluşturuluyor…
uk: Генерація сторінки…
vi: Đang tạo trang…
zh_hans: 正在生成页面…
zh_hant: 正在生成页面…

# codeFlow.state.ready
source: Local code graph is ready
ar: الرسم البياني المحلي للكود جاهز
de: Lokaler Code-Graph ist bereit
es: El grafo de código local está listo
fr: Le graphe de code local est prêt
id: Grafik kode lokal siap
it: Grafo del codice locale pronto
ja: ローカルコードグラフの準備ができました
ko: 로컬 코드 그래프 준비 완료
nl: Lokale codegrafiek is gereed
pl: Lokalny graf kodu jest gotowy
pt_br: Grafo de código local está pronto
ru: Локальный граф кода готов
tr: Yerel kod grafiği hazır
uk: Локальний граф коду готовий
vi: Đồ thị mã cục bộ đã sẵn sàng
zh_hans: 本地代码图谱已就绪
zh_hant: 本地代码图谱已就绪

# codeFlow.state.succeeded
source: Code graph opened in the browser
ar: تم فتح الرسم البياني للكود في المتصفح
de: Code-Graph im Browser geöffnet
es: Grafo de código abierto en el navegador
fr: Graphe de code ouvert dans le navigateur
id: Grafik kode dibuka di browser
it: Grafo del codice aperto nel browser
ja: コードグラフがブラウザで開かれました
ko: 브라우저에서 코드 그래프 열림
nl: Codegrafiek geopend in de browser
pl: Graf kodu otwarty w przeglądarce
pt_br: Grafo de código aberto no navegador
ru: Граф кода открыт в браузере
tr: Kod grafiği tarayıcıda açıldı
uk: Граф коду відкрито в браузері
vi: Đồ thị mã đã mở trong trình duyệt
zh_hans: 代码图谱已在浏览器中打开
zh_hant: 代码图谱已在浏览器中打开

# codeFlow.step.browserAnalysis.title
source: CodeFlow browser-side processing
ar: معالجة CodeFlow من جانب المتصفح
de: CodeFlow-Browserverarbeitung
es: Procesamiento del lado del navegador de CodeFlow
fr: Traitement côté navigateur CodeFlow
id: Pemrosesan sisi browser CodeFlow
it: Elaborazione lato browser CodeFlow
ja: CodeFlow ブラウザ側処理
ko: CodeFlow 브라우저 측 처리
nl: CodeFlow-verwerking aan browserzijde
pl: Przetwarzanie po stronie przeglądarki CodeFlow
pt_br: Processamento do CodeFlow no navegador
ru: Обработка на стороне браузера CodeFlow
tr: CodeFlow tarayıcı tarafı işleme
uk: Обробка на стороні браузера CodeFlow
vi: Xử lý phía trình duyệt CodeFlow
zh_hans: CodeFlow 浏览器端处理
zh_hant: CodeFlow 浏览器端处理

# codeFlow.step.detail.awaitingHandoff
source: Awaiting handoff
ar: بانتظار التسليم
de: Warte auf Übergabe
es: Esperando transferencia
fr: En attente de transfert
id: Menunggu penyerahan
it: In attesa di passaggio
ja: 引き渡し待ち
ko: 전달 대기 중
nl: Wachten op overdracht
pl: Oczekiwanie na przekazanie
pt_br: Aguardando entrega
ru: Ожидание передачи
tr: Teslim bekleniyor
uk: Очікування передачі
vi: Đang chờ chuyển giao
zh_hans: 等待交接
zh_hant: 等待交接

# codeFlow.step.detail.pending
source: Waiting
ar: قيد الانتظار
de: Warten
es: Esperando
fr: En attente
id: Menunggu
it: In attesa
ja: 待機中
ko: 대기 중
nl: Wachten
pl: Oczekiwanie
pt_br: Aguardando
ru: Ожидание
tr: Bekleniyor
uk: Очікування
vi: Đang chờ
zh_hans: 等待执行
zh_hant: 等待执行

# codeFlow.step.download.title
source: Fetch pinned-commit ZIP
ar: جلب ZIP المثبت عند commit
de: Pinned-Commit-ZIP abrufen
es: Obtener ZIP del commit fijo
fr: Récupérer le ZIP du commit épinglé
id: Ambil ZIP commit tetap
it: Recupera ZIP del commit fissato
ja: 固定コミットの ZIP を取得
ko: 고정 커밋 ZIP 가져오기
nl: Vastgelegde commit-ZIP ophalen
pl: Pobierz ZIP z przypiętym zatwierdzeniem
pt_br: Buscar ZIP do commit fixo
ru: Получить ZIP с фиксированным коммитом
tr: Sabitlenmiş işlem ZIP'ini getir
uk: Отримати ZIP з фіксованим комітом
vi: Tải xuống ZIP commit đã ghim
zh_hans: 获取固定 commit ZIP
zh_hant: 获取固定 commit ZIP

# codeFlow.step.generatePage.title
source: Generate and save CodeFlow page
ar: إنشاء وحفظ صفحة CodeFlow
de: CodeFlow-Seite generieren und speichern
es: Generar y guardar página de CodeFlow
fr: Générer et enregistrer la page CodeFlow
id: Hasilkan dan simpan halaman CodeFlow
it: Genera e salva pagina CodeFlow
ja: CodeFlow ページを生成して保存
ko: CodeFlow 페이지 생성 및 저장
nl: CodeFlow-pagina genereren en opslaan
pl: Wygeneruj i zapisz stronę CodeFlow
pt_br: Gerar e salvar página do CodeFlow
ru: Сгенерировать и сохранить страницу CodeFlow
tr: CodeFlow sayfasını oluştur ve kaydet
uk: Згенерувати та зберегти сторінку CodeFlow
vi: Tạo và lưu trang CodeFlow
zh_hans: 生成并保存 CodeFlow 页面
zh_hant: 生成并保存 CodeFlow 页面

# codeFlow.step.openBrowser.title
source: Open generated page in default browser
ar: فتح الصفحة المُنشأة في المتصفح الافتراضي
de: Generierte Seite im Standardbrowser öffnen
es: Abrir página generada en el navegador predeterminado
fr: Ouvrir la page générée dans le navigateur par défaut
id: Buka halaman yang dihasilkan di browser default
it: Apri pagina generata nel browser predefinito
ja: 生成したページをデフォルトブラウザで開く
ko: 생성된 페이지를 기본 브라우저에서 열기
nl: Gegenereerde pagina openen in standaardbrowser
pl: Otwórz wygenerowaną stronę w domyślnej przeglądarce
pt_br: Abrir página gerada no navegador padrão
ru: Открыть сгенерированную страницу в браузере по умолчанию
tr: Oluşturulan sayfayı varsayılan tarayıcıda aç
uk: Відкрити згенеровану сторінку в типовому браузері
vi: Mở trang đã tạo trong trình duyệt mặc định
zh_hans: 默认浏览器打开生成页
zh_hant: 默认浏览器打开生成页

# codeFlow.step.resolveRevision.title
source: Resolve branch HEAD
ar: تحديد HEAD الفرع
de: Branch-HEAD auflösen
es: Resolver HEAD de la rama
fr: Résoudre la HEAD de la branche
id: Selesaikan HEAD cabang
it: Risolvi HEAD del ramo
ja: ブランチ HEAD を解決
ko: 브랜치 HEAD 확인
nl: Branch HEAD bepalen
pl: Rozpoznaj HEAD gałęzi
pt_br: Resolver HEAD do branch
ru: Определить HEAD ветки
tr: Dal HEAD'ini çözümle
uk: Визначити HEAD гілки
vi: Phân giải HEAD của nhánh
zh_hans: 解析所选分支 HEAD
zh_hant: 解析所选分支 HEAD

# codeFlow.storage.error.invalidBookmark
source: Could not restore the CodeFlow directory bookmark. Please re-select the directory.
ar: تعذرت استعادة إشارة دليل CodeFlow المرجعية. يرجى إعادة تحديد الدليل.
de: Das CodeFlow-Verzeichnis-Lesezeichen konnte nicht wiederhergestellt werden. Bitte wählen Sie das Verzeichnis erneut aus.
es: No se pudo restaurar el marcador del directorio de CodeFlow. Vuelve a seleccionar el directorio.
fr: Impossible de restaurer le signet du répertoire CodeFlow. Veuillez resélectionner le répertoire.
id: Tidak dapat memulihkan bookmark direktori CodeFlow. Silakan pilih ulang direktori.
it: Impossibile ripristinare il segnalibro della directory CodeFlow. Seleziona di nuovo la directory.
ja: CodeFlow ディレクトリのブックマークを復元できませんでした。ディレクトリを再選択してください。
ko: CodeFlow 디렉토리 북마크를 복원할 수 없습니다. 디렉토리를 다시 선택하세요.
nl: Kan de CodeFlow-mapbladwijzer niet herstellen. Selecteer de map opnieuw.
pl: Nie można przywrócić zakładki katalogu CodeFlow. Wybierz katalog ponownie.
pt_br: Não foi possível restaurar o marcador do diretório do CodeFlow. Selecione o diretório novamente.
ru: Не удалось восстановить закладку каталога CodeFlow. Пожалуйста, выберите каталог заново.
tr: CodeFlow dizin yer imi geri yüklenemedi. Lütfen dizini yeniden seçin.
uk: Не вдалося відновити закладку каталогу CodeFlow. Виберіть каталог повторно.
vi: Không thể khôi phục dấu trang thư mục CodeFlow. Vui lòng chọn lại thư mục.
zh_hans: 无法恢复 CodeFlow 输出目录授权，请重新选择目录。
zh_hant: 无法恢复 CodeFlow 输出目录授权，请重新选择目录。

# codeFlow.storage.error.outputDirectoryUnavailable
source: CodeFlow output directory is unavailable. Please re-select it in Settings.
ar: دليل إخراج CodeFlow غير متاح. يرجى إعادة تحديده في الإعدادات.
de: CodeFlow-Ausgabeverzeichnis ist nicht verfügbar. Bitte wählen Sie es in den Einstellungen erneut aus.
es: El directorio de salida de CodeFlow no está disponible. Vuelve a seleccionarlo en Ajustes.
fr: Le répertoire de sortie CodeFlow est indisponible. Veuillez le resélectionner dans les réglages.
id: Direktori output CodeFlow tidak tersedia. Silakan pilih ulang di Pengaturan.
it: La directory di output di CodeFlow non è disponibile. Selezionala di nuovo in Impostazioni.
ja: CodeFlow の出力ディレクトリが利用できません。設定で再選択してください。
ko: CodeFlow 출력 디렉토리를 사용할 수 없습니다. 설정에서 다시 선택하세요.
nl: CodeFlow-uitvoermap is niet beschikbaar. Selecteer deze opnieuw in Instellingen.
pl: Katalog wyjściowy CodeFlow jest niedostępny. Wybierz go ponownie w Ustawieniach.
pt_br: O diretório de saída do CodeFlow está indisponível. Selecione-o novamente nas Configurações.
ru: Выходной каталог CodeFlow недоступен. Пожалуйста, выберите его заново в настройках.
tr: CodeFlow çıktı dizini kullanılamıyor. Lütfen Ayarlar'dan yeniden seçin.
uk: Каталог виведення CodeFlow недоступний. Виберіть його повторно в налаштуваннях.
vi: Thư mục đầu ra CodeFlow không khả dụng. Vui lòng chọn lại trong Cài đặt.
zh_hans: CodeFlow 输出目录不可用，请在设置中重新选择。
zh_hant: CodeFlow 输出目录不可用，请在设置中重新选择。

# codeFlow.version.branchChangedFormat
source: The current graph is from %1$@, but %2$@ is selected. Re-generation required.
ar: الرسم البياني الحالي من %1$@، لكن %2$@ محدد. يلزم إعادة التوليد.
de: Der aktuelle Graph stammt von %1$@, aber %2$@ ist ausgewählt. Neugenerierung erforderlich.
es: El grafo actual es de %1$@, pero está seleccionada %2$@. Se requiere regeneración.
fr: Le graphe actuel provient de %1$@, mais %2$@ est sélectionné. Une régénération est nécessaire.
id: Grafik saat ini dari %1$@, tetapi %2$@ dipilih. Diperlukan pembuatan ulang.
it: Il grafo corrente proviene da %1$@, ma %2$@ è selezionato. È necessaria una rigenerazione.
ja: 現在のグラフは %1$@ からのものですが、%2$@ が選択されています。再生成が必要です。
ko: 현재 그래프는 %1$@에서 가져왔지만 %2$@이(가) 선택되었습니다. 재생성이 필요합니다.
nl: De huidige grafiek is van %1$@, maar %2$@ is geselecteerd. Opnieuw genereren vereist.
pl: Bieżący graf pochodzi z %1$@, ale wybrano %2$@. Wymagane ponowne wygenerowanie.
pt_br: O grafo atual é de %1$@, mas %2$@ está selecionado. É necessário gerar novamente.
ru: Текущий граф из %1$@, но выбрана %2$@. Требуется перегенерация.
tr: Mevcut grafik %1$@ üzerinden, ancak %2$@ seçili. Yeniden oluşturma gerekli.
uk: Поточний граф з %1$@, але вибрано %2$@. Потрібна повторна генерація.
vi: Đồ thị hiện tại từ %1$@, nhưng %2$@ được chọn. Cần tạo lại.
zh_hans: 当前图谱来自 %1$@，已选择 %2$@，需要重新生成
zh_hant: 当前图谱来自 %1$@，已选择 %2$@，需要重新生成

# codeFlow.version.checkFailedFormat
source: Temporarily unable to check for updates: %@
ar: تعذر التحقق من التحديثات مؤقتًا: %@
de: Vorübergehend keine Überprüfung auf Updates möglich: %@
es: No se puede comprobar temporalmente si hay actualizaciones: %@
fr: Impossible temporairement de vérifier les mises à jour : %@
id: Untuk sementara tidak dapat memeriksa pembaruan: %@
it: Impossibile verificare temporaneamente la presenza di aggiornamenti: %@
ja: 一時的にアップデートを確認できません: %@
ko: 업데이트를 일시적으로 확인할 수 없습니다: %@
nl: Tijdelijk niet mogelijk om te controleren op updates: %@
pl: Tymczasowo nie można sprawdzić aktualizacji: %@
pt_br: Temporariamente impossível verificar atualizações: %@
ru: Временно невозможно проверить обновления: %@
tr: Güncellemeler geçici olarak kontrol edilemiyor: %@
uk: Тимчасово неможливо перевірити оновлення: %@
vi: Tạm thời không thể kiểm tra cập nhật: %@
zh_hans: 暂时无法检查更新：%@
zh_hant: 暂时无法检查更新：%@
